CSI API ETABS v1
cEditFrame.ChangeConnectivity Method
 Modifies the connectivity of a frame object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ChangeConnectivity(
	string Name,
	string Point1,
	string Point2
)
Function ChangeConnectivity (
	Name As String,
	Point1 As String,
	Point2 As String
) As Integer
Dim instance As cEditFrame
Dim Name As String
Dim Point1 As String
Dim Point2 As String
Dim returnValue As Integer
returnValue = instance.ChangeConnectivity(Name,
	Point1, Point2)
int ChangeConnectivity(
	String^ Name,
	String^ Point1,
	String^ Point2
)
abstract ChangeConnectivity :
        Name : string *
        Point1 : string *
        Point2 : string -> int
Parameters
Name
Type: System.String
 The name of an existing frame object
Point1
Type: System.String
 The name of the point object to set as the I-End of the frame object
Point2
Type: System.String
 The name of the point object to set as the J-End of the frame object
Return Value
Type: Int32
 Returns zero if the frame object connectivity is successfully modified; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'modify connectivity
       ret = SapModel.EditFrame.ChangeConnectivity("8", "3", "5")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cEditFrame Interface
ETABSv1 Namespace